tool/linux-cli.org
#+TITLE: Linux 常用命令
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2019-02-18 Mon 11:04:00>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+TAGS: route cli route

* 日常使用
  - ~ctrl-x ctrl-e~ 调用编辑器来编辑长命令
  - ~ctrl-r~ 回溯历史命令
  - 暴露服务器当前目录的文件:
    - Python 2: ~python -m SimpleHTTPServer 7777~
    - Python 3: ~python -m http.server 7777~

** 帮助文档
   #+BEGIN_SRC sh
     # 查看 topic 的相关文档
     man topic
     # 搜索 keyword 的 topic
     man -k keyword
   #+END_SRC

* 用户管理
** 查看用户信息
   #+BEGIN_SRC sh
     # 显示当前用户名
     whoami
     # 显示已经登录的用户，三种命令显示风格不同
     who
     w
     users

     # 查看用户指纹，用户 id，名字，登录状态
     finger user
     # 查看用户的各种 id，uid，gid
     id user
     # 打印 uid
     id -u user
     # 打印 gid
     id -g user

     # 查看最近登录用户日志
     last
     # 查看 user 的最近登录日志
     last user
     # 查看最近登录失败的日志
     lastb
   #+END_SRC

** 修改用户信息
   #+BEGIN_SRC sh
     # 添加用户
     useradd user
     useradd -m user # 创建用户，同时创建家目录；但不设置用户密码
     # 删除用户 -r 选项删除用户并移除家目录和邮箱
     userdel user
     userdel -r user

     # 添加用户，1. 调用 useradd 新建用户; 2. 创建用户的家目录; 3. 为用户设置密码
     adduser user
     # 删除用户，2. 动员 userdel 删除用户；2. 删除用户的家目录
     deluser user

     # 修改密码, 重置密码
     passwd
     sudo passwd user
   #+END_SRC

** 修改用户组
   #+BEGIN_SRC sh
     # 新建一个组
     groupadd group

     # 将 user 添加到 group 中
     usermod -aG group user
     # 将当前用户添加到 group 中
     usermod -aG group $USER

     # 修改用户的登录 shell
     usermod -s /bin/zsh user
   #+END_SRC

* 文件系统
** 目录操作
*** 查看目录信息
    #+BEGIN_SRC sh
      # 列出当前目录的内容
      ls
      # 只显示文件名
      ls -1
      # 显示隐藏文件
      ls -a
      # 按招时间由新到旧排序
      ls -t
    #+END_SRC

*** 修改目录
    #+BEGIN_SRC sh
      # 进入 dir 目录
      cd dir
      # 打印当前目录
      pwd
      # 返回到家目录
      cd
      # 返回之前的目录
      cd -
      # 返回之前第 N 个目录, cd -2 返回倒数第二个目录
      cd -N
      # 返回到 git 根目录
      cd $(git rev-parse --show-toplevel)

      # 新建目录
      mkdir dir
      # 递归新建多级目录
      mkdir -p dir1/dir2/dir3

      # 目录栈的入栈和出栈
      pushd dir
      popd
      # 列出当前目录栈
      dirs -v
    #+END_SRC

** 文件操作
