tool/linux-cli.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-22 Sat 20:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux 常用命令</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Linux 常用命令</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcfb292e">1. 日常使用</a>
<ul>
<li><a href="#orgfb68d78">1.1. 帮助文档</a></li>
</ul>
</li>
<li><a href="#orgb00ce97">2. 用户管理</a>
<ul>
<li><a href="#org045abbf">2.1. 查看用户信息</a></li>
<li><a href="#org5ef8227">2.2. 修改用户信息</a></li>
<li><a href="#org8ba6472">2.3. 修改用户组</a></li>
</ul>
</li>
<li><a href="#orgdd9d358">3. 文件系统</a>
<ul>
<li><a href="#orgdaf5911">3.1. 目录操作</a>
<ul>
<li><a href="#orgeb329b4">3.1.1. 查看目录信息</a></li>
<li><a href="#org79448b9">3.1.2. 修改目录</a></li>
</ul>
</li>
<li><a href="#org9822c5f">3.2. 文件操作</a>
<ul>
<li><a href="#orgc45a5cf">3.2.1. 查看文件信息</a></li>
<li><a href="#org6e371a4">3.2.2. 文件复制、移动和删除</a></li>
<li><a href="#orgc1e4f1f">3.2.3. 大文件分割和合并</a></li>
<li><a href="#orgdf3c64c">3.2.4. 更新文件信息</a></li>
<li><a href="#org66d38b2">3.2.5. 重定向</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd19cb93">4. 进程管理</a>
<ul>
<li><a href="#org262c44b">4.1. 查看进程</a></li>
<li><a href="#org75a325a">4.2. 监控进程</a></li>
<li><a href="#org5cf13a8">4.3. 后台进程</a></li>
</ul>
</li>
<li><a href="#org92a0054">5. 远程交换</a>
<ul>
<li><a href="#orge0f5347">5.1. ssh</a></li>
<li><a href="#orgea68d49">5.2. scp 和 rsync</a></li>
</ul>
</li>
<li><a href="#org42ef02d">6. 网络管理</a>
<ul>
<li><a href="#org9d6169b">6.1. route</a></li>
<li><a href="#org01a2047">6.2. ifconfig</a></li>
<li><a href="#orga2494b3">6.3. netstat</a></li>
<li><a href="#orgb44208d">6.4. ping/traceroute/whois 网络连通性和 DNS</a></li>
<li><a href="#org0e92e60">6.5. nmap 网络和端口扫描</a></li>
<li><a href="#orgf9b0518">6.6. ssh 代理</a></li>
</ul>
</li>
<li><a href="#orga386061">7. 文本处理</a>
<ul>
<li><a href="#orgd28d8b7">7.1. 普通处理</a></li>
<li><a href="#orgb307a16">7.2. sed</a></li>
<li><a href="#org85c22a6">7.3. awk</a></li>
<li><a href="#org0ff3820">7.4. jq</a></li>
<li><a href="#orgb93b481">7.5. 文本排序</a></li>
</ul>
</li>
<li><a href="#orgc8f8a8f">8. 杂项</a></li>
<li><a href="#org47e3bef">9. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcfb292e" class="outline-2">
<h2 id="orgcfb292e"><span class="section-number-2">1</span> 日常使用</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>ctrl-x ctrl-e</code> 调用编辑器来编辑长命令</li>
<li><code>ctrl-r</code> 回溯历史命令</li>
<li>暴露服务器当前目录的文件:
<ul class="org-ul">
<li>Python 2: <code>python -m SimpleHTTPServer 7777</code></li>
<li>Python 3: <code>python -m http.server 7777</code></li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgfb68d78" class="outline-3">
<h3 id="orgfb68d78"><span class="section-number-3">1.1</span> 帮助文档</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475; topic &#30340;&#30456;&#20851;&#25991;&#26723;</span>
man topic
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25628;&#32034; keyword &#30340; topic</span>
man -k keyword
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb00ce97" class="outline-2">
<h2 id="orgb00ce97"><span class="section-number-2">2</span> 用户管理</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org045abbf" class="outline-3">
<h3 id="org045abbf"><span class="section-number-3">2.1</span> 查看用户信息</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#24403;&#21069;&#29992;&#25143;&#21517;</span>
whoami
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#24050;&#32463;&#30331;&#24405;&#30340;&#29992;&#25143;&#65292;&#19977;&#31181;&#21629;&#20196;&#26174;&#31034;&#39118;&#26684;&#19981;&#21516;</span>
who
w
users

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#29992;&#25143;&#25351;&#32441;&#65292;&#29992;&#25143; id&#65292;&#21517;&#23383;&#65292;&#30331;&#24405;&#29366;&#24577;</span>
finger user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#29992;&#25143;&#30340;&#21508;&#31181; id&#65292;uid&#65292;gid</span>
id user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360; uid</span>
id -u user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360; gid</span>
id -g user

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#26368;&#36817;&#30331;&#24405;&#29992;&#25143;&#26085;&#24535;</span>
last
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475; user &#30340;&#26368;&#36817;&#30331;&#24405;&#26085;&#24535;</span>
last user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#26368;&#36817;&#30331;&#24405;&#22833;&#36133;&#30340;&#26085;&#24535;</span>
lastb
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ef8227" class="outline-3">
<h3 id="org5ef8227"><span class="section-number-3">2.2</span> 修改用户信息</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#28155;&#21152;&#29992;&#25143;</span>
useradd user
useradd -m user <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21019;&#24314;&#29992;&#25143;&#65292;&#21516;&#26102;&#21019;&#24314;&#23478;&#30446;&#24405;&#65307;&#20294;&#19981;&#35774;&#32622;&#29992;&#25143;&#23494;&#30721;</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#29992;&#25143;</span>
userdel user

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#28155;&#21152;&#29992;&#25143;&#65292;1. &#35843;&#29992; useradd &#26032;&#24314;&#29992;&#25143;; 2. &#21019;&#24314;&#29992;&#25143;&#30340;&#23478;&#30446;&#24405;; 3. &#20026;&#29992;&#25143;&#35774;&#32622;&#23494;&#30721;</span>
adduser user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#29992;&#25143;&#65292;2. &#21160;&#21592; userdel &#21024;&#38500;&#29992;&#25143;&#65307;2. &#21024;&#38500;&#29992;&#25143;&#30340;&#23478;&#30446;&#24405;</span>
deluser user

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20462;&#25913;&#23494;&#30721;, &#37325;&#32622;&#23494;&#30721;</span>
passwd
sudo passwd user
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ba6472" class="outline-3">
<h3 id="org8ba6472"><span class="section-number-3">2.3</span> 修改用户组</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26032;&#24314;&#19968;&#20010;&#32452;</span>
groupadd group

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558; user &#28155;&#21152;&#21040; group &#20013;</span>
usermod -aG group user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558;&#24403;&#21069;&#29992;&#25143;&#28155;&#21152;&#21040; group &#20013;</span>
usermod -aG group $<span style="color: #6c71c4;">USER</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20462;&#25913;&#29992;&#25143;&#30340;&#30331;&#24405; shell</span>
usermod -s /bin/zsh user
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd9d358" class="outline-2">
<h2 id="orgdd9d358"><span class="section-number-2">3</span> 文件系统</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdaf5911" class="outline-3">
<h3 id="orgdaf5911"><span class="section-number-3">3.1</span> 目录操作</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgeb329b4" class="outline-4">
<h4 id="orgeb329b4"><span class="section-number-4">3.1.1</span> 查看目录信息</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21015;&#20986;&#24403;&#21069;&#30446;&#24405;&#30340;&#20869;&#23481;</span>
ls
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21482;&#26174;&#31034;&#25991;&#20214;&#21517;</span>
ls -1
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#38544;&#34255;&#25991;&#20214;</span>
ls -a
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353;&#25307;&#26102;&#38388;&#30001;&#26032;&#21040;&#26087;&#25490;&#24207;</span>
ls -t
</pre>
</div>
</div>
</div>

<div id="outline-container-org79448b9" class="outline-4">
<h4 id="org79448b9"><span class="section-number-4">3.1.2</span> 修改目录</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36827;&#20837; dir &#30446;&#24405;</span>
<span style="color: #6c71c4;">cd</span> dir
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#24403;&#21069;&#30446;&#24405;</span>
<span style="color: #6c71c4;">pwd</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36820;&#22238;&#21040;&#23478;&#30446;&#24405;</span>
<span style="color: #6c71c4;">cd</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36820;&#22238;&#20043;&#21069;&#30340;&#30446;&#24405;</span>
<span style="color: #6c71c4;">cd</span> -
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36820;&#22238;&#20043;&#21069;&#31532; N &#20010;&#30446;&#24405;, cd -2 &#36820;&#22238;&#20498;&#25968;&#31532;&#20108;&#20010;&#30446;&#24405;</span>
<span style="color: #6c71c4;">cd</span> -N
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36820;&#22238;&#21040; git &#26681;&#30446;&#24405;</span>
<span style="color: #6c71c4;">cd</span> $(git rev-parse --show-toplevel)

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26032;&#24314;&#30446;&#24405;</span>
mkdir dir
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36882;&#24402;&#26032;&#24314;&#22810;&#32423;&#30446;&#24405;</span>
mkdir -p dir1/dir2/dir3

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#30446;&#24405;&#26632;&#30340;&#20837;&#26632;&#21644;&#20986;&#26632;</span>
<span style="color: #6c71c4;">pushd</span> dir
<span style="color: #6c71c4;">popd</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21015;&#20986;&#24403;&#21069;&#30446;&#24405;&#26632;</span>
<span style="color: #6c71c4;">dirs</span> -v
</pre>
</div>
</div>
</div>
</div>
