tool/linux-cli.org
*** 查看文件信息
    #+BEGIN_SRC sh
      # 打印文件内容
      cat file
      # 查看文件行数
      wc -l file
      # 打印文件头部行数
      head file
      head -n 3 file
      # 打印文件尾部行数
      tail file
      tail -n 3 file

      # 文件的名字（不包含路径）
      basename file
      # 文件的路径（不包含名字）
      dirname file

      # 检测文件类型和编码
      file file
      # 文件的详细信息
      stat file

      # 分页查看, less is more, less 可以往回翻页， more 不行
      less file
      more file

      # less 查看文件，直接跳到 120 行
      less -n+120 /pass/to/file
      less +120 /pass/to/file
    #+END_SRC

*** 文件复制、移动和删除
    #+BEGIN_SRC sh
      # 复制文件
      cp src dest
      # 递归复制文件
      cp -rf src dest
      # 更新模式复制文件，即 src 比 dest 新则复制
      cp -u src dest
      # 移动文件，重命名文件
      mv src dest
      # 删除文件
      rm file
      # 递归删除，非常小心地用这个命令
      rm -rf dir

      # 创建软连接, dest 是所指向的文件，link 是软连接
      # 例如: ln -s /tmp ~/Public/tmp 相当于在 ~/Public 中建了一个 tmp 软连接，指向 /tmp
      ln -s dest link
    #+END_SRC

*** 大文件分割和合并
    #+BEGIN_SRC sh
      # 按行数分割
      split -l 300 largefile.txt new_file_prefix.
      # 按字节大小分割
      split -b 10m largefile.zip new_file_prefix.

      # 合并文件
      cat new_file_prefix.* > largefile.zip
    #+END_SRC

*** 更新文件信息
    #+BEGIN_SRC sh
      # 更新一下文件
      touch file

      # 更新文件权限为 644，-R 可以递归修改
      chmod 644 file
      # 更新文件的组/用户，-R 可以递归修改
      chgrp group file
      chown user file
      # 同时更改文件的组合用户，-R 可以递归修改
      chown user:group file
    #+END_SRC

*** 重定向
    #+BEGIN_SRC sh
      # 将 cmd 的 stdout 重定向到 file 中
      cmd > file
      # 将 cmd 的 stderr 重定向到 file 中
      cmd 2> file
      # 将 cmd 的 stdout 和 stderr 重定向到 file 中, 2>&1 的必须放在 > file 后面
      cmd > file 2>&1

      # 将 cmd 的 stdout 和 stderr 重定向到 /dev/null 中，并挂载成后台任务
      cmd >/dev/null 2>&1 &
    #+END_SRC

* 进程管理
** 查看进程
   #+BEGIN_SRC sh
     # 以不同模式查看进程
     ps
     ps -ef
     ps aux
     # 查看用户名 user 的进程
     ps -u user
     # 指定格式查看进程
     ps -eo pid,user,command
     # 查看父进程 ppid 为 1 的子进程
     ps -eo ppid,pid,user,command | awk '$1 ~ /^1$/'
   #+END_SRC

** 监控进程
   #+BEGIN_SRC sh
     # 进程监视器
     top

     # 进程监视器, 仅仅监控 user 的进程
     top -u user
     top -u $USER

     # htop 和 top 类似，但是比 top 要好看一点，需要安装
     htop

     # 内存监视器
     vmstat
     # 每 3 秒打印一行内存和 CPU 使用情况
     vmstat 3
     # 查看内存和 swap 的使用情况
     free
     # 每 3 秒刷新显示
     while sleep 3; do clear && free; done
   #+END_SRC

