tool/linux-cli.html

<div id="outline-container-org9822c5f" class="outline-3">
<h3 id="org9822c5f"><span class="section-number-3">3.2</span> 文件操作</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgc45a5cf" class="outline-4">
<h4 id="orgc45a5cf"><span class="section-number-4">3.2.1</span> 查看文件信息</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#20869;&#23481;</span>
cat file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25991;&#20214;&#34892;&#25968;</span>
wc -l file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#22836;&#37096;&#34892;&#25968;</span>
head file
head -n 3 file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#23614;&#37096;&#34892;&#25968;</span>
tail file
tail -n 3 file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25991;&#20214;&#30340;&#21517;&#23383;&#65288;&#19981;&#21253;&#21547;&#36335;&#24452;&#65289;</span>
basename file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25991;&#20214;&#30340;&#36335;&#24452;&#65288;&#19981;&#21253;&#21547;&#21517;&#23383;&#65289;</span>
dirname file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26816;&#27979;&#25991;&#20214;&#31867;&#22411;&#21644;&#32534;&#30721;</span>
file file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25991;&#20214;&#30340;&#35814;&#32454;&#20449;&#24687;</span>
stat file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20998;&#39029;&#26597;&#30475;, less is more, less &#21487;&#20197;&#24448;&#22238;&#32763;&#39029;&#65292; more &#19981;&#34892;</span>
less file
more file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">less &#26597;&#30475;&#25991;&#20214;&#65292;&#30452;&#25509;&#36339;&#21040; 120 &#34892;</span>
less -n+120 /pass/to/file
less +120 /pass/to/file
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e371a4" class="outline-4">
<h4 id="org6e371a4"><span class="section-number-4">3.2.2</span> 文件复制、移动和删除</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22797;&#21046;&#25991;&#20214;</span>
cp src dest
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36882;&#24402;&#22797;&#21046;&#25991;&#20214;</span>
cp -rf src dest
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26356;&#26032;&#27169;&#24335;&#22797;&#21046;&#25991;&#20214;&#65292;&#21363; src &#27604; dest &#26032;&#21017;&#22797;&#21046;</span>
cp -u src dest
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#31227;&#21160;&#25991;&#20214;&#65292;&#37325;&#21629;&#21517;&#25991;&#20214;</span>
mv src dest
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#25991;&#20214;</span>
rm file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36882;&#24402;&#21024;&#38500;&#65292;&#38750;&#24120;&#23567;&#24515;&#22320;&#29992;&#36825;&#20010;&#21629;&#20196;</span>
rm -rf dir

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21019;&#24314;&#36719;&#36830;&#25509;, dest &#26159;&#25152;&#25351;&#21521;&#30340;&#25991;&#20214;&#65292;link &#26159;&#36719;&#36830;&#25509;</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20363;&#22914;: ln -s /tmp ~/Public/tmp &#30456;&#24403;&#20110;&#22312; ~/Public &#20013;&#24314;&#20102;&#19968;&#20010; tmp &#36719;&#36830;&#25509;&#65292;&#25351;&#21521; /tmp</span>
ln -s dest link
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1e4f1f" class="outline-4">
<h4 id="orgc1e4f1f"><span class="section-number-4">3.2.3</span> 大文件分割和合并</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353;&#34892;&#25968;&#20998;&#21106;</span>
split -l 300 largefile.txt new_file_prefix.
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353;&#23383;&#33410;&#22823;&#23567;&#20998;&#21106;</span>
split -b 10m largefile.zip new_file_prefix.

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21512;&#24182;&#25991;&#20214;</span>
cat new_file_prefix.* &gt; largefile.zip
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf3c64c" class="outline-4">
<h4 id="orgdf3c64c"><span class="section-number-4">3.2.4</span> 更新文件信息</h4>
<div class="outline-text-4" id="text-3-2-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26356;&#26032;&#19968;&#19979;&#25991;&#20214;</span>
touch file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26356;&#26032;&#25991;&#20214;&#26435;&#38480;&#20026; 644&#65292;-R &#21487;&#20197;&#36882;&#24402;&#20462;&#25913;</span>
chmod 644 file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26356;&#26032;&#25991;&#20214;&#30340;&#32452;/&#29992;&#25143;&#65292;-R &#21487;&#20197;&#36882;&#24402;&#20462;&#25913;</span>
chgrp group file
chown user file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21516;&#26102;&#26356;&#25913;&#25991;&#20214;&#30340;&#32452;&#21512;&#29992;&#25143;&#65292;-R &#21487;&#20197;&#36882;&#24402;&#20462;&#25913;</span>
chown user:group file
</pre>
</div>
</div>
</div>

<div id="outline-container-org66d38b2" class="outline-4">
<h4 id="org66d38b2"><span class="section-number-4">3.2.5</span> 重定向</h4>
<div class="outline-text-4" id="text-3-2-5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558; cmd &#30340; stdout &#37325;&#23450;&#21521;&#21040; file &#20013;</span>
cmd &gt; file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558; cmd &#30340; stderr &#37325;&#23450;&#21521;&#21040; file &#20013;</span>
cmd 2&gt; file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558; cmd &#30340; stdout &#21644; stderr &#37325;&#23450;&#21521;&#21040; file &#20013;, 2&gt;&amp;1 &#30340;&#24517;&#39035;&#25918;&#22312; &gt; file &#21518;&#38754;</span>
cmd &gt; file 2&gt;&amp;1

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558; cmd &#30340; stdout &#21644; stderr &#37325;&#23450;&#21521;&#21040; /dev/null &#20013;&#65292;&#24182;&#25346;&#36733;&#25104;&#21518;&#21488;&#20219;&#21153;</span>
cmd &gt;/dev/null 2&gt;&amp;1 &amp;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd19cb93" class="outline-2">
<h2 id="orgd19cb93"><span class="section-number-2">4</span> 进程管理</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org262c44b" class="outline-3">
<h3 id="org262c44b"><span class="section-number-3">4.1</span> 查看进程</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20197;&#19981;&#21516;&#27169;&#24335;&#26597;&#30475;&#36827;&#31243;</span>
ps
ps -ef
ps aux
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#29992;&#25143;&#21517; user &#30340;&#36827;&#31243;</span>
ps -u user
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25351;&#23450;&#26684;&#24335;&#26597;&#30475;&#36827;&#31243;</span>
ps -eo pid,user,command
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#29238;&#36827;&#31243; ppid &#20026; 1 &#30340;&#23376;&#36827;&#31243;</span>
ps -eo ppid,pid,user,command | awk <span style="color: #2aa198;">'$1 ~ /^1$/'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org75a325a" class="outline-3">
<h3 id="org75a325a"><span class="section-number-3">4.2</span> 监控进程</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36827;&#31243;&#30417;&#35270;&#22120;</span>
top

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36827;&#31243;&#30417;&#35270;&#22120;, &#20165;&#20165;&#30417;&#25511; user &#30340;&#36827;&#31243;</span>
top -u user
top -u $<span style="color: #6c71c4;">USER</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">htop &#21644; top &#31867;&#20284;&#65292;&#20294;&#26159;&#27604; top &#35201;&#22909;&#30475;&#19968;&#28857;&#65292;&#38656;&#35201;&#23433;&#35013;</span>
htop

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20869;&#23384;&#30417;&#35270;&#22120;</span>
vmstat
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#27599; 3 &#31186;&#25171;&#21360;&#19968;&#34892;&#20869;&#23384;&#21644; CPU &#20351;&#29992;&#24773;&#20917;</span>
vmstat 3
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#20869;&#23384;&#21644; swap &#30340;&#20351;&#29992;&#24773;&#20917;</span>
free
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#27599; 3 &#31186;&#21047;&#26032;&#26174;&#31034;</span>
<span style="color: #859900;">while</span> sleep 3; <span style="color: #859900;">do</span> clear &amp;&amp; free; <span style="color: #859900;">done</span>
</pre>
</div>
</div>
</div>
