tool/linux-cli.org
** 后台进程
   #+BEGIN_SRC sh
     # & 符号表示将进程挂在后台运行
     cmd &
     # 查看所有后台进程
     jobs
     # 查看后台进程，并切换过去
     bg
     # 切换后台进程到前台
     fg
     # 切换指定的 job 到前台
     fg jid

     # 长期运行后台进程，退出 shell 后任然保持运行
     nohup cmd
     # 在后台长期运行程序
     nohup cmd &
     # 将指定 pid 或者 jid 从后台任务列表移除
     disown pid|jid
     # 等待所以后台进程任务结束
     wait
   #+END_SRC

* 远程交换
** ssh
   #+BEGIN_SRC sh
     # 远程登录
     ssh user@host
     # 指定 ssh 端口为 2222 登录到远程机器上
     ssh -p 2222 user@host

     # 生成 ssh 公钥和私钥
     ssh-keygen -t rsa -b 4096 -C "hujinghui@buaa.edu.cn"

     # 复制 ssh 公钥到远程机器上
     ssh-copy-id user@host
     ssh-copy-id -i ~/.ssh/id_rsa.pub user@host

     # ssh 到远程机器上，并执行 cmd 命令
     ssh user@host cmd
   #+END_SRC

** scp 和 rsync
   #+BEGIN_SRC sh
     # 本地到远程复制文件, -r 选项表示递归复制
     scp file user@host:path
     scp user@host:path file
     scp -r file user@host:path

     # 增量同步文件
     rsync -av dir user@host:path
     # 增量同步文件，显示同步的进度
     rsync -av --progress dir user@host:path
     # 增量同步文件，忽略 *.log 文件
     rsync -av --exclude='*.log' dir user@host:path
     # 增量同步文件，删除远程中多余的文件
     rsync -av --delete dir user@host:path
     # 增量同步文件，删除远程中多余的文件， *.log 文件会被忽略，不会被删除
     rsync -av --exclude='*.log' --delete dir user@host:path
   #+END_SRC

* 软件包管理器
** rpm & yum
   #+BEGIN_SRC sh
     # 直接安装
     rpm -ivh package-name.bla.rpm
     # 忽略报错，强制安装
     rpmrpm --force -ivh your-package.rpm
     # 查询 rpm
     rpm -ql tree
     # 卸载 rpm 软件包
     rpm -e tree

     # 返回软件包的全名
     rpm -qf `which git`
     # 返回软件包的有关信息
     rpm -qif `which git`
     # 返回软件包的文件列表
     rpm -qlf `which git`
   #+END_SRC

   #+BEGIN_SRC sh
     # 安装指定的安装包 package
     yum install package
     # 全部更新
     yum update
     # 删除程序包 package
     yum remove package
     # 下载包缓存信息
     yum makecache
   #+END_SRC
** dpkg & apt-get
   #+BEGIN_SRC sh
     # 安装软件包
     dpkg -i package.bal.deb
     # 从软件包里面读取软件的信息
     pkg -A package.bla.deb
     # 安装一个目录下面所有的软件包
     dpkg -R /path/to/folder
     # 删除软件包（保留其配置信息）
     dpkg -r avg71flm
   #+END_SRC

   #+BEGIN_SRC sh
     # 刷新存储库索引
     apt update
     apt-get update
     # 升级所有可升级的软件包
     apt upgrade
     apt-get upgrade
     # 安装软件包
     apt install package
     apt-get install package
     # 移除软件包
     apt remove package
     apt-get remove package
     # 移除软件包及配置文件
     apt purge package
     apt-get purge package
     # 自动删除不需要的包
     apt autoremove
     apt-get autoremove
     # 搜索应用程序
     apt search text
     apt-cache search text
     # 显示装细节
     apt show package
     apt-cache show package
   #+END_SRC
* 网络管理
** route
   #+BEGIN_SRC sh
     # 打印路由表
     route -n

     # 添加默认网关为 192.168.1.1, 即默认路由
     route add default gw 192.168.1.1
     # 添加一条普通路由项
     route add 192.168.1.0/32 gw 192.168.1.1

     # 删除默认路由
     route del default gw 192.168.1.1
   #+END_SRC

** ifconfig
   #+BEGIN_SRC sh
     # 显示所有网卡和接口信息
     ifconfig

     # 显示所有网卡（包括开机没启动的）信息
     ifconfig -a

     # 指定设备显示信息
     ifconfig eth0

     # 激活网卡
     ifconfig eth0 up
     # 关闭网卡
     ifconfig eth0 down

     # 给网卡配置 IP 地址
     ifconfig eth0 192.168.120.56
     # 配置 IP 并启动
     ifconfig eth0 192.168.120.56 netmask 255.255.255.0 up
     # 修改 MAC 地址
     ifconfig eth0 hw ether 00:aa:bb:cc:dd:ee
   #+END_SRC

** netstat
   #+BEGIN_SRC sh
     # 列出所有端口
     netstat -a
     # 查看所有连接信息，不解析域名
     netstat -an
     # 查看所有连接信息，包含进程信息（需要 sudo）
     netstat -anp
     # 查看所有监听的端口
     netstat -l
     # 查看所有 TCP 链接
     netstat -t
     # 显示所有正在监听的 TCP 和 UDP 信息
     netstat -lntu
     # 显示所有正在监听的 socket 及进程信息
     netstat -lntup
     # 显示网卡信息
     netstat -i
     # 显示当前系统路由表，同 route -n
     netstat -rn
   #+END_SRC

