tool/linux-cli.html

<div id="outline-container-org5cf13a8" class="outline-3">
<h3 id="org5cf13a8"><span class="section-number-3">4.3</span> 后台进程</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&amp; &#31526;&#21495;&#34920;&#31034;&#23558;&#36827;&#31243;&#25346;&#22312;&#21518;&#21488;&#36816;&#34892;</span>
cmd &amp;
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25152;&#26377;&#21518;&#21488;&#36827;&#31243;</span>
<span style="color: #6c71c4;">jobs</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#21518;&#21488;&#36827;&#31243;&#65292;&#24182;&#20999;&#25442;&#36807;&#21435;</span>
<span style="color: #6c71c4;">bg</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20999;&#25442;&#21518;&#21488;&#36827;&#31243;&#21040;&#21069;&#21488;</span>
<span style="color: #6c71c4;">fg</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20999;&#25442;&#25351;&#23450;&#30340; job &#21040;&#21069;&#21488;</span>
<span style="color: #6c71c4;">fg</span> jid

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#38271;&#26399;&#36816;&#34892;&#21518;&#21488;&#36827;&#31243;&#65292;&#36864;&#20986; shell &#21518;&#20219;&#28982;&#20445;&#25345;&#36816;&#34892;</span>
nohup cmd
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22312;&#21518;&#21488;&#38271;&#26399;&#36816;&#34892;&#31243;&#24207;</span>
nohup cmd &amp;
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558;&#25351;&#23450; pid &#25110;&#32773; jid &#20174;&#21518;&#21488;&#20219;&#21153;&#21015;&#34920;&#31227;&#38500;</span>
<span style="color: #6c71c4;">disown</span> pid|jid
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#31561;&#24453;&#25152;&#20197;&#21518;&#21488;&#36827;&#31243;&#20219;&#21153;&#32467;&#26463;</span>
<span style="color: #6c71c4;">wait</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org92a0054" class="outline-2">
<h2 id="org92a0054"><span class="section-number-2">5</span> 远程交换</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge0f5347" class="outline-3">
<h3 id="orge0f5347"><span class="section-number-3">5.1</span> ssh</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36828;&#31243;&#30331;&#24405;</span>
ssh user@host
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25351;&#23450; ssh &#31471;&#21475;&#20026; 2222 &#30331;&#24405;&#21040;&#36828;&#31243;&#26426;&#22120;&#19978;</span>
ssh -p 2222 user@host

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#29983;&#25104; ssh &#20844;&#38053;&#21644;&#31169;&#38053;</span>
ssh-keygen -t rsa -b 4096 -C <span style="color: #2aa198;">"hujinghui@buaa.edu.cn"</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22797;&#21046; ssh &#20844;&#38053;&#21040;&#36828;&#31243;&#26426;&#22120;&#19978;</span>
ssh-copy-id user@host
ssh-copy-id -i ~/.ssh/id_rsa.pub user@host

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">ssh &#21040;&#36828;&#31243;&#26426;&#22120;&#19978;&#65292;&#24182;&#25191;&#34892; cmd &#21629;&#20196;</span>
ssh user@host cmd
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea68d49" class="outline-3">
<h3 id="orgea68d49"><span class="section-number-3">5.2</span> scp 和 rsync</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26412;&#22320;&#21040;&#36828;&#31243;&#22797;&#21046;&#25991;&#20214;, -r &#36873;&#39033;&#34920;&#31034;&#36882;&#24402;&#22797;&#21046;</span>
scp file user@host:path
scp user@host:path file
scp -r file user@host:path

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22686;&#37327;&#21516;&#27493;&#25991;&#20214;</span>
rsync -av dir user@host:path
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22686;&#37327;&#21516;&#27493;&#25991;&#20214;&#65292;&#26174;&#31034;&#21516;&#27493;&#30340;&#36827;&#24230;</span>
rsync -av --progress dir user@host:path
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22686;&#37327;&#21516;&#27493;&#25991;&#20214;&#65292;&#24573;&#30053; *.log &#25991;&#20214;</span>
rsync -av --exclude=<span style="color: #2aa198;">'*.log'</span> dir user@host:path
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22686;&#37327;&#21516;&#27493;&#25991;&#20214;&#65292;&#21024;&#38500;&#36828;&#31243;&#20013;&#22810;&#20313;&#30340;&#25991;&#20214;</span>
rsync -av --delete dir user@host:path
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22686;&#37327;&#21516;&#27493;&#25991;&#20214;&#65292;&#21024;&#38500;&#36828;&#31243;&#20013;&#22810;&#20313;&#30340;&#25991;&#20214;&#65292; *.log &#25991;&#20214;&#20250;&#34987;&#24573;&#30053;&#65292;&#19981;&#20250;&#34987;&#21024;&#38500;</span>
rsync -av --exclude=<span style="color: #2aa198;">'*.log'</span> --delete dir user@host:path
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org42ef02d" class="outline-2">
<h2 id="org42ef02d"><span class="section-number-2">6</span> 网络管理</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9d6169b" class="outline-3">
<h3 id="org9d6169b"><span class="section-number-3">6.1</span> route</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#36335;&#30001;&#34920;</span>
route -n

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#28155;&#21152;&#40664;&#35748;&#32593;&#20851;&#20026; 192.168.1.1, &#21363;&#40664;&#35748;&#36335;&#30001;</span>
route add default gw 192.168.1.1
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#28155;&#21152;&#19968;&#26465;&#26222;&#36890;&#36335;&#30001;&#39033;</span>
route add 192.168.1.0/32 gw 192.168.1.1

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#40664;&#35748;&#36335;&#30001;</span>
route del default gw 192.168.1.1
</pre>
</div>
</div>
</div>

<div id="outline-container-org01a2047" class="outline-3">
<h3 id="org01a2047"><span class="section-number-3">6.2</span> ifconfig</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#25152;&#26377;&#32593;&#21345;&#21644;&#25509;&#21475;&#20449;&#24687;</span>
ifconfig

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#25152;&#26377;&#32593;&#21345;&#65288;&#21253;&#25324;&#24320;&#26426;&#27809;&#21551;&#21160;&#30340;&#65289;&#20449;&#24687;</span>
ifconfig -a

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25351;&#23450;&#35774;&#22791;&#26174;&#31034;&#20449;&#24687;</span>
ifconfig eth0

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#28608;&#27963;&#32593;&#21345;</span>
ifconfig eth0 up
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20851;&#38381;&#32593;&#21345;</span>
ifconfig eth0 down

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#32473;&#32593;&#21345;&#37197;&#32622; IP &#22320;&#22336;</span>
ifconfig eth0 192.168.120.56
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#37197;&#32622; IP &#24182;&#21551;&#21160;</span>
ifconfig eth0 192.168.120.56 netmask 255.255.255.0 up
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20462;&#25913; MAC &#22320;&#22336;</span>
ifconfig eth0 hw ether 00:aa:bb:cc:dd:ee
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2494b3" class="outline-3">
<h3 id="orga2494b3"><span class="section-number-3">6.3</span> netstat</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21015;&#20986;&#25152;&#26377;&#31471;&#21475;</span>
netstat -a
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25152;&#26377;&#36830;&#25509;&#20449;&#24687;&#65292;&#19981;&#35299;&#26512;&#22495;&#21517;</span>
netstat -an
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25152;&#26377;&#36830;&#25509;&#20449;&#24687;&#65292;&#21253;&#21547;&#36827;&#31243;&#20449;&#24687;&#65288;&#38656;&#35201; sudo&#65289;</span>
netstat -anp
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25152;&#26377;&#30417;&#21548;&#30340;&#31471;&#21475;</span>
netstat -l
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25152;&#26377; TCP &#38142;&#25509;</span>
netstat -t
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#25152;&#26377;&#27491;&#22312;&#30417;&#21548;&#30340; TCP &#21644; UDP &#20449;&#24687;</span>
netstat -lntu
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#25152;&#26377;&#27491;&#22312;&#30417;&#21548;&#30340; socket &#21450;&#36827;&#31243;&#20449;&#24687;</span>
netstat -lntup
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#32593;&#21345;&#20449;&#24687;</span>
netstat -i
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034;&#24403;&#21069;&#31995;&#32479;&#36335;&#30001;&#34920;&#65292;&#21516; route -n</span>
netstat -rn
</pre>
</div>
</div>
</div>
