tool/linux-cli.org
** ping/traceroute/whois 网络连通性和 DNS
   #+BEGIN_SRC sh
     # 连通性
     ping host/ip
     ping -c 3 host/ip

     # 路由跳转追踪
     traceroute host

     # 查看暴露的外网 ip
     curl http://httpbin.org/ip

     # DNS 查询
     host domain
     whois domain
     dig domain
   #+END_SRC

** nmap 网络和端口扫描
   #+BEGIN_SRC sh
     # 扫描一个主机的所有信息
     nmap 192.168.0.110

     # 扫描主机是否开机
     nmap -sn 192.168.0.0/24

     # 扫描特定范围的 IP
     nmap -F 192.168.0.0/24
     nmap -F 192.168.0.*
     nmap -F 192.168.0.110,111,112
     nmap 192.168.0.100-199

     # 扫描特定的端口号
     nmap -p 80 192.168.0.*
     nmap -p 9000-9999 192.168.0.110
   #+END_SRC

** ssh 代理
   #+BEGIN_SRC sh
     # 在本地 9595 端口开启一个 socks5 的代理服务
     ssh -N -D 9595 user@proxyer

     # 测试连通性: --socks5-hostname 表示使用代理机的 DNS 来解析域名
     curl --socks5-hostname 127.0.0.1:9595 http://httpbin.org/ip

     # 优雅地启动 socks5 代理
     # -f 挂后台, -q 静默, -n 屏蔽 stdin, -T 阻止分配 tty, -C 压缩
     # -N 不执行 ssh 命令，只作端口转发， -D 指定本地监听端口号
     ssh -fqnCTN -D 9595 user@proxyer

     # 反向代理：将外网主机（202.115.8.1）端口（8443）转发到内网主机 192.168.1.2:443
     ssh -qnCTN -R 0.0.0.0:8443:192.168.1.2:443  user@202.115.8.1

     # 正向代理：将本地主机的 8443 端口，通过 192.168.1.3 转发到 192.168.1.2:443
     ssh -qnCTN -L 0.0.0.0:8443:192.168.1.2:443  user@192.168.1.3
   #+END_SRC

* 文本处理
** 普通处理
   简单的文本处理使用 tr/cut/paste 等，复杂的文本处理使用 sed/awk
   #+BEGIN_SRC sh
     # 截取每行头 16 个字符
     cut -c 1-16
     # 截取指定文件中每行头 16 个字符
     cut -c 1-16 file
     # 截取每行从第三个字符开始到行末的内容
     cut -c3-
     # 截取用冒号分隔的第五列内容
     cut -d':' -f5
     # 截取用分号分隔的第二和第十列内容
     cut -d';' -f2,10
     # 截取空格分隔的三到七列
     cut -d' ' -f3-7

     # 显示 hel
     echo "hello" | cut -c1-3
     # 显示 sir
     echo "hello sir" | cut -d' ' -f2
     # cut 搭配 tr 压缩字符
     ps | tr -s " " | cut -d " " -f 2,3,4
     # 打印 PATH 变量
     echo $PATH | tr : '\n'
   #+END_SRC

** sed
   sed 是 Linux 下著名的行编辑器
   #+BEGIN_SRC sh
     # 替换文件中首次出现的字符串并输出结果
     sed 's/find/replace/' file
     # 替换文件第 10 行内容
     sed '10s/find/replace/' file
     # 替换文件中 10-20 行内容
     sed '10,20s/find/replace/' file

     # 替换文件中所有出现的字符串
     sed -r 's/regex/replace/g' file

     # 替换文件中所有出现的字符并且覆盖文件
     sed -i 's/find/replace/g' file
     # 在文件的匹配文本前插入行
     sed -i '/find/i\newline' file
     # 在文件的匹配文本后插入行
     sed -i '/find/a\newline' file

     # 先搜索行特征再执行替换
     sed '/line/s/find/replace/' file
     # 执行多次替换
     sed -e 's/f/r/' -e 's/f/r' file

     # 使用 # 替换 / 来避免 pattern 中有斜杆
     sed 's#find#replace#' file

     # 删除第 1 行内容
     sed -i '1d' file
     # 删除文件每行头部空格
     sed -i -r 's/^\s+//g' file
     # 删除文件空行并打印
     sed '/^$/d' file
     # 删除文件每行末尾多余空格
     sed -i 's/\s\+$//' file

     # 打印文件第二行
     sed -n '2p' file
     # 打印文件第二到第五行
     sed -n '2,5p' file
   #+END_SRC

