tool/linux-cli.html

<div id="outline-container-orgb44208d" class="outline-3">
<h3 id="orgb44208d"><span class="section-number-3">6.4</span> ping/traceroute/whois 网络连通性和 DNS</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36830;&#36890;&#24615;</span>
ping host/ip
ping -c 3 host/ip

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#36335;&#30001;&#36339;&#36716;&#36861;&#36394;</span>
traceroute host

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#26292;&#38706;&#30340;&#22806;&#32593; ip</span>
curl http://httpbin.org/ip

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">DNS &#26597;&#35810;</span>
host domain
whois domain
dig domain
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e92e60" class="outline-3">
<h3 id="org0e92e60"><span class="section-number-3">6.5</span> nmap 网络和端口扫描</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25195;&#25551;&#19968;&#20010;&#20027;&#26426;&#30340;&#25152;&#26377;&#20449;&#24687;</span>
nmap 192.168.0.110

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25195;&#25551;&#20027;&#26426;&#26159;&#21542;&#24320;&#26426;</span>
nmap -sn 192.168.0.0/24

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25195;&#25551;&#29305;&#23450;&#33539;&#22260;&#30340; IP</span>
nmap -F 192.168.0.0/24
nmap -F 192.168.0.*
nmap -F 192.168.0.110,111,112
nmap 192.168.0.100-199

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25195;&#25551;&#29305;&#23450;&#30340;&#31471;&#21475;&#21495;</span>
nmap -p 80 192.168.0.*
nmap -p 9000-9999 192.168.0.110
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9b0518" class="outline-3">
<h3 id="orgf9b0518"><span class="section-number-3">6.6</span> ssh 代理</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22312;&#26412;&#22320; 9595 &#31471;&#21475;&#24320;&#21551;&#19968;&#20010; socks5 &#30340;&#20195;&#29702;&#26381;&#21153;</span>
ssh -N -D 9595 user@proxyer

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#27979;&#35797;&#36830;&#36890;&#24615;: --socks5-hostname &#34920;&#31034;&#20351;&#29992;&#20195;&#29702;&#26426;&#30340; DNS &#26469;&#35299;&#26512;&#22495;&#21517;</span>
curl --socks5-hostname 127.0.0.1:9595 http://httpbin.org/ip

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20248;&#38597;&#22320;&#21551;&#21160; socks5 &#20195;&#29702;</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">-f &#25346;&#21518;&#21488;, -q &#38745;&#40664;, -n &#23631;&#34109; stdin, -T &#38459;&#27490;&#20998;&#37197; tty, -C &#21387;&#32553;</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">-N &#19981;&#25191;&#34892; ssh &#21629;&#20196;&#65292;&#21482;&#20316;&#31471;&#21475;&#36716;&#21457;&#65292; -D &#25351;&#23450;&#26412;&#22320;&#30417;&#21548;&#31471;&#21475;&#21495;</span>
ssh -fqnCTN -D 9595 user@proxyer

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21453;&#21521;&#20195;&#29702;&#65306;&#23558;&#22806;&#32593;&#20027;&#26426;&#65288;202.115.8.1&#65289;&#31471;&#21475;&#65288;8443&#65289;&#36716;&#21457;&#21040;&#20869;&#32593;&#20027;&#26426; 192.168.1.2:443</span>
ssh -qnCTN -R 0.0.0.0:8443:192.168.1.2:443  user@202.115.8.1

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#27491;&#21521;&#20195;&#29702;&#65306;&#23558;&#26412;&#22320;&#20027;&#26426;&#30340; 8443 &#31471;&#21475;&#65292;&#36890;&#36807; 192.168.1.3 &#36716;&#21457;&#21040; 192.168.1.2:443</span>
ssh -qnCTN -L 0.0.0.0:8443:192.168.1.2:443  user@192.168.1.3
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga386061" class="outline-2">
<h2 id="orga386061"><span class="section-number-2">7</span> 文本处理</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd28d8b7" class="outline-3">
<h3 id="orgd28d8b7"><span class="section-number-3">7.1</span> 普通处理</h3>
<div class="outline-text-3" id="text-7-1">
<p>
简单的文本处理使用 tr/cut/paste 等，复杂的文本处理使用 sed/awk
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#21462;&#27599;&#34892;&#22836; 16 &#20010;&#23383;&#31526;</span>
cut -c 1-16
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#21462;&#25351;&#23450;&#25991;&#20214;&#20013;&#27599;&#34892;&#22836; 16 &#20010;&#23383;&#31526;</span>
cut -c 1-16 file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#21462;&#27599;&#34892;&#20174;&#31532;&#19977;&#20010;&#23383;&#31526;&#24320;&#22987;&#21040;&#34892;&#26411;&#30340;&#20869;&#23481;</span>
cut -c3-
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#21462;&#29992;&#20882;&#21495;&#20998;&#38548;&#30340;&#31532;&#20116;&#21015;&#20869;&#23481;</span>
cut -d<span style="color: #2aa198;">':'</span> -f5
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#21462;&#29992;&#20998;&#21495;&#20998;&#38548;&#30340;&#31532;&#20108;&#21644;&#31532;&#21313;&#21015;&#20869;&#23481;</span>
cut -d<span style="color: #2aa198;">';'</span> -f2,10
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#21462;&#31354;&#26684;&#20998;&#38548;&#30340;&#19977;&#21040;&#19971;&#21015;</span>
cut -d<span style="color: #2aa198;">' '</span> -f3-7

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034; hel</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">"hello"</span> | cut -c1-3
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26174;&#31034; sir</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">"hello sir"</span> | cut -d<span style="color: #2aa198;">' '</span> -f2
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">cut &#25645;&#37197; tr &#21387;&#32553;&#23383;&#31526;</span>
ps | tr -s <span style="color: #2aa198;">" "</span> | cut -d <span style="color: #2aa198;">" "</span> -f 2,3,4
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360; PATH &#21464;&#37327;</span>
<span style="color: #6c71c4;">echo</span> $<span style="color: #6c71c4;">PATH</span> | tr : <span style="color: #2aa198;">'\n'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb307a16" class="outline-3">
<h3 id="orgb307a16"><span class="section-number-3">7.2</span> sed</h3>
<div class="outline-text-3" id="text-7-2">
<p>
sed 是 Linux 下著名的行编辑器
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26367;&#25442;&#25991;&#20214;&#20013;&#39318;&#27425;&#20986;&#29616;&#30340;&#23383;&#31526;&#20018;&#24182;&#36755;&#20986;&#32467;&#26524;</span>
sed <span style="color: #2aa198;">'s/find/replace/'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26367;&#25442;&#25991;&#20214;&#31532; 10 &#34892;&#20869;&#23481;</span>
sed <span style="color: #2aa198;">'10s/find/replace/'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26367;&#25442;&#25991;&#20214;&#20013; 10-20 &#34892;&#20869;&#23481;</span>
sed <span style="color: #2aa198;">'10,20s/find/replace/'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26367;&#25442;&#25991;&#20214;&#20013;&#25152;&#26377;&#20986;&#29616;&#30340;&#23383;&#31526;&#20018;</span>
sed -r <span style="color: #2aa198;">'s/regex/replace/g'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26367;&#25442;&#25991;&#20214;&#20013;&#25152;&#26377;&#20986;&#29616;&#30340;&#23383;&#31526;&#24182;&#19988;&#35206;&#30422;&#25991;&#20214;</span>
sed -i <span style="color: #2aa198;">'s/find/replace/g'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22312;&#25991;&#20214;&#30340;&#21305;&#37197;&#25991;&#26412;&#21069;&#25554;&#20837;&#34892;</span>
sed -i <span style="color: #2aa198;">'/find/i\newline'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22312;&#25991;&#20214;&#30340;&#21305;&#37197;&#25991;&#26412;&#21518;&#25554;&#20837;&#34892;</span>
sed -i <span style="color: #2aa198;">'/find/a\newline'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20808;&#25628;&#32034;&#34892;&#29305;&#24449;&#20877;&#25191;&#34892;&#26367;&#25442;</span>
sed <span style="color: #2aa198;">'/line/s/find/replace/'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25191;&#34892;&#22810;&#27425;&#26367;&#25442;</span>
sed -e <span style="color: #2aa198;">'s/f/r/'</span> -e <span style="color: #2aa198;">'s/f/r'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20351;&#29992; # &#26367;&#25442; / &#26469;&#36991;&#20813; pattern &#20013;&#26377;&#26012;&#26438;</span>
sed <span style="color: #2aa198;">'s#find#replace#'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#31532; 1 &#34892;&#20869;&#23481;</span>
sed -i <span style="color: #2aa198;">'1d'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#25991;&#20214;&#27599;&#34892;&#22836;&#37096;&#31354;&#26684;</span>
sed -i -r <span style="color: #2aa198;">'s/^\s+//g'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#25991;&#20214;&#31354;&#34892;&#24182;&#25171;&#21360;</span>
sed <span style="color: #2aa198;">'/^$/d'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21024;&#38500;&#25991;&#20214;&#27599;&#34892;&#26411;&#23614;&#22810;&#20313;&#31354;&#26684;</span>
sed -i <span style="color: #2aa198;">'s/\s\+$//'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#31532;&#20108;&#34892;</span>
sed -n <span style="color: #2aa198;">'2p'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#31532;&#20108;&#21040;&#31532;&#20116;&#34892;</span>
sed -n <span style="color: #2aa198;">'2,5p'</span> file
</pre>
</div>
</div>
</div>
