tool/linux-cli.org
** awk
   awk 一般用于文本预处理，并且支持编程
   #+BEGIN_SRC sh
     # -F 选项指定分隔符, 默认以空格分隔
     awk -F ':' '{print $1}' file

     # 使用正则表达式匹配过滤结果
     awk '/reg/ {print $5}' file
     awk '$1 ~ /reg/ {print $5}' file
     # 打印用户名以 b 开头的用户名
     awk -F ':' ' $1 ~ /^b/ {print $1}' /etc/passwd

     # 打印文件中以空格分隔的第五列
     awk '{print $5}' file
     # 打印文件中以逗号分隔的第五列
     awk -F ',' '{print $5}' file
     # 打印文件中包含 str 的所有行的第二列
     awk '/str/ {print $2}' file
     # 打印逗号分隔的文件中的每行最后一列
     awk -F ',' '{print $NF}' file
     # 计算所有第一列的和
     awk '{s+=$1} END {print s}' file
     # 从第一行开始，每隔三行打印一行
     awk 'NR%3==1' file
   #+END_SRC

** jq
   [[https://stedolan.github.io/jq/][jq]] 可以处理 JSON 文本
   #+BEGIN_SRC sh
     # Identity: .
     echo '{"a":1, "b": "bla"}' | jq '.'

     # Object Identifier-Index: .foo, .foo.bar,
     echo '{"a":1, "b": "bla"}' | jq '.b'

     # Generic Object Index: .["foo.bar"]
     echo '{"a":1, "b": "bla", "c": { "k": "kill"}}' | jq '.["b"]'

     # Optional Object Identifier-Index: .foo?
     echo '{"a":1, "b": "bla"}' | jq '.b?'

     # Array Index: .[2]
     echo '[1, 2, 3]' | jq '.[1]'

     # Array Slice: .[0:1]
     echo '[1, 2, 3]' | jq '.[0:2]'

     # Array/Object Value Iterator: .[]
     echo '[1, 2, 3]' | jq '.[]'
     echo '{"a":1, "b": "bla"}' | jq '.[]'

     # Comma: ,
     echo '{"a":1, "b": "bla", "c": 3}' | jq '.a,.b'

     # Pipe: |
     echo '{"a":1, "b": "bla", "c": [1, 2, 3]}' | jq '.c|.[]'

     # Array construction: []
     # Object Construction: {}
   #+END_SRC

   去除字符串的双引号，jq 在输出 json 时遇到字符串会添加上双引号，可以使用 =-r= 选
   项来去除双引号
   #+BEGIN_SRC text
     ~ $ echo '["a", "b", "c"]' | jq '.[]'
     "a"
     "b"
     "c"
     ~ $ echo '["a", "b", "c"]' | jq -r '.[]'
     a
     b
     c
   #+END_SRC

** 文本排序
   #+BEGIN_SRC sh
     # 排序文件
     sort file
     # 反向排序（降序）
     sort -r file
     # 使用数字而不是字符串进行比较
     sort -n file
     # 按 passwd 文件的第三列进行排序, -t 表示分隔符
     sort -t: -k 3n /etc/passwd
     # 去重排序
     sort -u file
   #+END_SRC

* 杂项
  #+BEGIN_SRC sh
    # 查看文件系统的结构和定义
    man hier
    # 查看 ASCII 表
    man ascii

    # 在线查看速查表
    curl -L cheat.sh
    curl -L cheat.sh/find

    # 查看系统是 32 位还是 64 位
    getconf LONG_BIT

    # 快速备份文件
    cp file.txt{,.bak}

    # 从网络上的压缩文件中解出一个文件来，并避免保存中间文件
    wget -qO - "http://www.tarball.com/tarball.tar.gz" | tar zxvf -
    # 下载 zip 文件并解压，注意： unzip 6.00 后不能从 stdin 中读取，需要存成本地文件
    curl -sL -o a.zip "http://localhost/a.zip" && unzip a.zip && rm -f a.zip

    # 使用光盘制作 iso 文件
    cp /dev/cdrom /path/to/file.iso
    dd if=/dev/cdrom of=/path/to/file.iso
    # 使用目录制作 iso 文件
    mkisofs -r -o /path/to/file.iso /home/Public
    # Linux 下挂载一个 iso 文件
    mount -o loop /path/to/file.iso /mnt/cdrom

    # 按日期范围查找文件
    find . -type f -newermt "2010-01-01" ! -newermt "2010-06-01"

    # Vim 中保存一个没有权限的文件
    :w !sudo tee > /dev/null %

    # 获取终端的一些基本信息：宽度，长度等
    stty -a

    # 将 list 的输出转化成二维矩阵显示方式
    ls | column

    # 时间戳 -> 字符串, 1564848000
    date -d '2019-08-04 00:00:00' +%s
    # 字符串 -> 时间戳, 2019-08-04 00:00:20
    date -d @1564848200 +'%Y-%m-%d %H:%H:%S'
  #+END_SRC

