tool/linux-cli.html

<div id="outline-container-org85c22a6" class="outline-3">
<h3 id="org85c22a6"><span class="section-number-3">7.3</span> awk</h3>
<div class="outline-text-3" id="text-7-3">
<p>
awk 一般用于文本预处理，并且支持编程
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">-F &#36873;&#39033;&#25351;&#23450;&#20998;&#38548;&#31526;, &#40664;&#35748;&#20197;&#31354;&#26684;&#20998;&#38548;</span>
awk -F <span style="color: #2aa198;">':'</span> <span style="color: #2aa198;">'{print $1}'</span> file

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#21305;&#37197;&#36807;&#28388;&#32467;&#26524;</span>
awk <span style="color: #2aa198;">'/reg/ {print $5}'</span> file
awk <span style="color: #2aa198;">'$1 ~ /reg/ {print $5}'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#29992;&#25143;&#21517;&#20197; b &#24320;&#22836;&#30340;&#29992;&#25143;&#21517;</span>
awk -F <span style="color: #2aa198;">':'</span> <span style="color: #2aa198;">' $1 ~ /^b/ {print $1}'</span> /etc/passwd

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#20013;&#20197;&#31354;&#26684;&#20998;&#38548;&#30340;&#31532;&#20116;&#21015;</span>
awk <span style="color: #2aa198;">'{print $5}'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#20013;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#31532;&#20116;&#21015;</span>
awk -F <span style="color: #2aa198;">','</span> <span style="color: #2aa198;">'{print $5}'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#25991;&#20214;&#20013;&#21253;&#21547; str &#30340;&#25152;&#26377;&#34892;&#30340;&#31532;&#20108;&#21015;</span>
awk <span style="color: #2aa198;">'/str/ {print $2}'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25171;&#21360;&#36887;&#21495;&#20998;&#38548;&#30340;&#25991;&#20214;&#20013;&#30340;&#27599;&#34892;&#26368;&#21518;&#19968;&#21015;</span>
awk -F <span style="color: #2aa198;">','</span> <span style="color: #2aa198;">'{print $NF}'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#35745;&#31639;&#25152;&#26377;&#31532;&#19968;&#21015;&#30340;&#21644;</span>
awk <span style="color: #2aa198;">'{s+=$1} END {print s}'</span> file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20174;&#31532;&#19968;&#34892;&#24320;&#22987;&#65292;&#27599;&#38548;&#19977;&#34892;&#25171;&#21360;&#19968;&#34892;</span>
awk <span style="color: #2aa198;">'NR%3==1'</span> file
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ff3820" class="outline-3">
<h3 id="org0ff3820"><span class="section-number-3">7.4</span> jq</h3>
<div class="outline-text-3" id="text-7-4">
<p>
<a href="https://stedolan.github.io/jq/">jq</a> 可以处理 JSON 文本
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Identity: .</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla"}'</span> | jq <span style="color: #2aa198;">'.'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Object Identifier-Index: .foo, .foo.bar,</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla"}'</span> | jq <span style="color: #2aa198;">'.b'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Generic Object Index: .["foo.bar"]</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla", "c": { "k": "kill"}}'</span> | jq <span style="color: #2aa198;">'.["b"]'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Optional Object Identifier-Index: .foo?</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla"}'</span> | jq <span style="color: #2aa198;">'.b?'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Array Index: .[2]</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'[1, 2, 3]'</span> | jq <span style="color: #2aa198;">'.[1]'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Array Slice: .[0:1]</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'[1, 2, 3]'</span> | jq <span style="color: #2aa198;">'.[0:2]'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Array/Object Value Iterator: .[]</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'[1, 2, 3]'</span> | jq <span style="color: #2aa198;">'.[]'</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla"}'</span> | jq <span style="color: #2aa198;">'.[]'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Comma: ,</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla", "c": 3}'</span> | jq <span style="color: #2aa198;">'.a,.b'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Pipe: |</span>
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'{"a":1, "b": "bla", "c": [1, 2, 3]}'</span> | jq <span style="color: #2aa198;">'.c|.[]'</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Array construction: []</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Object Construction: {}</span>
</pre>
</div>

<p>
去除字符串的双引号，jq 在输出 json 时遇到字符串会添加上双引号，可以使用 <code>-r</code> 选
项来去除双引号
</p>
<div class="org-src-container">
<pre class="src src-text">~ $ echo '["a", "b", "c"]' | jq '.[]'
"a"
"b"
"c"
~ $ echo '["a", "b", "c"]' | jq -r '.[]'
a
b
c
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb93b481" class="outline-3">
<h3 id="orgb93b481"><span class="section-number-3">7.5</span> 文本排序</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25490;&#24207;&#25991;&#20214;</span>
sort file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21453;&#21521;&#25490;&#24207;&#65288;&#38477;&#24207;&#65289;</span>
sort -r file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20351;&#29992;&#25968;&#23383;&#32780;&#19981;&#26159;&#23383;&#31526;&#20018;&#36827;&#34892;&#27604;&#36739;</span>
sort -n file
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353; passwd &#25991;&#20214;&#30340;&#31532;&#19977;&#21015;&#36827;&#34892;&#25490;&#24207;, -t &#34920;&#31034;&#20998;&#38548;&#31526;</span>
sort -t: -k 3n /etc/passwd
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#21435;&#37325;&#25490;&#24207;</span>
sort -u file
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc8f8a8f" class="outline-2">
<h2 id="orgc8f8a8f"><span class="section-number-2">8</span> 杂项</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#25991;&#20214;&#31995;&#32479;&#30340;&#32467;&#26500;&#21644;&#23450;&#20041;</span>
man hier
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475; ASCII &#34920;</span>
man ascii

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22312;&#32447;&#26597;&#30475;&#36895;&#26597;&#34920;</span>
curl -L cheat.sh
curl -L cheat.sh/find

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#31995;&#32479;&#26159; 32 &#20301;&#36824;&#26159; 64 &#20301;</span>
getconf LONG_BIT

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#24555;&#36895;&#22791;&#20221;&#25991;&#20214;</span>
cp file.txt{,.bak}

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20174;&#32593;&#32476;&#19978;&#30340;&#21387;&#32553;&#25991;&#20214;&#20013;&#35299;&#20986;&#19968;&#20010;&#25991;&#20214;&#26469;&#65292;&#24182;&#36991;&#20813;&#20445;&#23384;&#20013;&#38388;&#25991;&#20214;</span>
wget -qO - <span style="color: #2aa198;">"http://www.tarball.com/tarball.tar.gz"</span> | tar zxvf -
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#19979;&#36733; zip &#25991;&#20214;&#24182;&#35299;&#21387;&#65292;&#27880;&#24847;&#65306; unzip 6.00 &#21518;&#19981;&#33021;&#20174; stdin &#20013;&#35835;&#21462;&#65292;&#38656;&#35201;&#23384;&#25104;&#26412;&#22320;&#25991;&#20214;</span>
curl -sL -o a.zip <span style="color: #2aa198;">"http://localhost/a.zip"</span> &amp;&amp; unzip a.zip &amp;&amp; rm -f a.zip

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20351;&#29992;&#20809;&#30424;&#21046;&#20316; iso &#25991;&#20214;</span>
cp /dev/cdrom /path/to/file.iso
dd <span style="color: #6c71c4;">if</span>=/dev/cdrom <span style="color: #6c71c4;">of</span>=/path/to/file.iso
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#20351;&#29992;&#30446;&#24405;&#21046;&#20316; iso &#25991;&#20214;</span>
mkisofs -r -o /path/to/file.iso /home/Public
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Linux &#19979;&#25346;&#36733;&#19968;&#20010; iso &#25991;&#20214;</span>
mount -o loop /path/to/file.iso /mnt/cdrom

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353;&#26085;&#26399;&#33539;&#22260;&#26597;&#25214;&#25991;&#20214;</span>
find . -type f -newermt <span style="color: #2aa198;">"2010-01-01"</span> ! -newermt <span style="color: #2aa198;">"2010-06-01"</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Vim &#20013;&#20445;&#23384;&#19968;&#20010;&#27809;&#26377;&#26435;&#38480;&#30340;&#25991;&#20214;</span>
:w !sudo tee &gt; /dev/null %

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#33719;&#21462;&#32456;&#31471;&#30340;&#19968;&#20123;&#22522;&#26412;&#20449;&#24687;&#65306;&#23485;&#24230;&#65292;&#38271;&#24230;&#31561;</span>
stty -a

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23558; list &#30340;&#36755;&#20986;&#36716;&#21270;&#25104;&#20108;&#32500;&#30697;&#38453;&#26174;&#31034;&#26041;&#24335;</span>
ls | column

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26102;&#38388;&#25139; -&gt; &#23383;&#31526;&#20018;, 1564848000</span>
date -d <span style="color: #2aa198;">'2019-08-04 00:00:00'</span> +%s
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#23383;&#31526;&#20018; -&gt; &#26102;&#38388;&#25139;, 2019-08-04 00:00:20</span>
date -d @1564848200 +<span style="color: #2aa198;">'%Y-%m-%d %H:%H:%S'</span>
</pre>
</div>
</div>
</div>
